MiEcosystem/mijia_ble_api/efr32_api.c
/* Bluetooth stack headers */
#include "bg_types.h"
#include "native_gecko.h"
#include "gatt_db.h"

#include "mbedtls/aes.h"

#include "efr32_api.h"
#include "em_cmu.h"
#include "em_msc.h"
#include "em_gpio.h"
#include "mible_log.h"
#include "mible_api.h"
#include "efr32_api.h"
#include "stdbool.h"

#include "bg_gattdb_def.h"

#define MAX_TASK_NUM                    4
#define ADV_HANDLE                      0
#define CHAR_TABLE_NUM                  10
#define CHAR_DATA_LEN_MAX               20

// connection handle
uint8_t m_conn_handle = DISCONNECTION;

// scanning? advertising? .. It could be optimized to use bit mask
uint8_t scanning = 0;
uint8_t advertising = 0;

// All retry caches
uint8_t scan_timeout_for_retry;
uint8_t connect_param_for_retry = 0xFF;

typedef struct {
	uint16_t handle;
	bool rd_author;		// read authorization. Enabel or Disable MIBLE_GATTS_READ_PERMIT_REQ event
	bool wr_author;     // write authorization. Enabel or Disable MIBLE_GATTS_WRITE_PERMIT_REQ event
	uint8_t char_property;
	uint8_t len;
	uint8_t data[CHAR_DATA_LEN_MAX];
} user_char_t;

struct{
	uint8_t num;
	user_char_t item[CHAR_TABLE_NUM];
} m_char_table;

#define TIMER_MAX_NUM 4

typedef struct {
    uint8_t id;
    uint8_t is_avail;
    mible_timer_mode is_single_shot;
    mible_timer_handler handler;
    void * p_ctx;
} timer_item_t;

static timer_item_t m_timer_pool[TIMER_MAX_NUM] = {
    [0] = { .id = 0, .is_avail = 1, },
    [1] = { .id = 1, .is_avail = 1, },
    [2] = { .id = 2, .is_avail = 1, },
    [3] = { .id = 3, .is_avail = 1, },
};

static timer_item_t* acquire_timer()
{
    uint8_t i;
    for (i = 0; i < TIMER_MAX_NUM; i++) {
        if (m_timer_pool[i].is_avail) {
            m_timer_pool[i].is_avail = 0;
            return &m_timer_pool[i];
        }
    }
    return NULL;
}

static int release_timer(void* timer_id)
{
    for (uint8_t i = 0; i < TIMER_MAX_NUM; i++) {
        if (timer_id == &m_timer_pool[i]) {
            m_timer_pool[i].is_avail = 1;
            return i;
        }
    }
    return -1;
}

static int assert_timer(void* timer_id)
{
    for (uint8_t i = 0; i < TIMER_MAX_NUM; i++) {
        if (timer_id == &m_timer_pool[i]) {
            return i;
        }
    }
    return -1;
}

void mible_stack_event_handler(struct gecko_cmd_packet *evt)
{
    uint16_t result;
    mible_gap_evt_param_t gap_evt_param = {0};
    mible_gatts_evt_param_t gatts_evt_param = {0};

    switch (BGLIB_MSG_ID(evt->header)) {
    case gecko_evt_le_connection_opened_id:
        m_conn_handle = evt->data.evt_le_connection_opened.connection;
        gap_evt_param.conn_handle = evt->data.evt_le_connection_opened.connection;
        memcpy(gap_evt_param.connect.peer_addr,
                evt->data.evt_le_connection_opened.address.addr, 6);
        gap_evt_param.connect.role =
                (mible_gap_role_t) evt->data.evt_le_connection_opened.master;
        if ((evt->data.evt_le_connection_opened.address_type == le_gap_address_type_public)
                || (evt->data.evt_le_connection_opened.address_type
                        == le_gap_address_type_public_identity)) {
            gap_evt_param.connect.type = MIBLE_ADDRESS_TYPE_PUBLIC;
        } else {
            gap_evt_param.connect.type = MIBLE_ADDRESS_TYPE_RANDOM;
        }

        mible_gap_event_callback(MIBLE_GAP_EVT_CONNECTED, &gap_evt_param);
    break;

    case gecko_evt_le_connection_closed_id:
        m_conn_handle = DISCONNECTION;
        gap_evt_param.conn_handle = evt->data.evt_le_connection_closed.connection;
        if (evt->data.evt_le_connection_closed.reason == bg_err_bt_connection_timeout) {
            gap_evt_param.disconnect.reason = CONNECTION_TIMEOUT;
        } else if (evt->data.evt_le_connection_closed.reason
                == bg_err_bt_remote_user_terminated) {
            gap_evt_param.disconnect.reason = REMOTE_USER_TERMINATED;
        } else if (evt->data.evt_le_connection_closed.reason
                == bg_err_bt_connection_terminated_by_local_host) {
            gap_evt_param.disconnect.reason = LOCAL_HOST_TERMINATED;
        }
        mible_gap_event_callback(MIBLE_GAP_EVT_DISCONNET, &gap_evt_param);
    break;

    case gecko_evt_le_gap_scan_response_id:
        /* Invalid the connection handle since no connection yet*/
        gap_evt_param.conn_handle = INVALID_CONNECTION_HANDLE;
        memcpy(gap_evt_param.report.peer_addr,
                evt->data.evt_le_gap_scan_response.address.addr, 6);
        gap_evt_param.report.addr_type =
                (mible_addr_type_t) evt->data.evt_le_gap_scan_response.address_type;
        if (evt->data.evt_le_gap_scan_response.packet_type == 0x04) {
            gap_evt_param.report.adv_type = SCAN_RSP_DATA;
        } else {
            gap_evt_param.report.adv_type = ADV_DATA;
        }
        gap_evt_param.report.rssi = evt->data.evt_le_gap_scan_response.rssi;
        memcpy(gap_evt_param.report.data, evt->data.evt_le_gap_scan_response.data.data,
                evt->data.evt_le_gap_scan_response.data.len);
        gap_evt_param.report.data_len = evt->data.evt_le_gap_scan_response.data.len;

        mible_gap_event_callback(MIBLE_GAP_EVT_ADV_REPORT, &gap_evt_param);
    break;

    case gecko_evt_le_connection_parameters_id:
        gap_evt_param.conn_handle =
                evt->data.evt_le_connection_parameters.connection;
        gap_evt_param.update_conn.conn_param.min_conn_interval =
                evt->data.evt_le_connection_parameters.interval;
        gap_evt_param.update_conn.conn_param.max_conn_interval =
                evt->data.evt_le_connection_parameters.interval;
        gap_evt_param.update_conn.conn_param.slave_latency =
                evt->data.evt_le_connection_parameters.latency;
        gap_evt_param.update_conn.conn_param.conn_sup_timeout =
                evt->data.evt_le_connection_parameters.timeout;

        mible_gap_event_callback(MIBLE_GAP_EVT_CONN_PARAM_UPDATED, &gap_evt_param);
    break;

    case gecko_evt_gatt_server_attribute_value_id: {

        uint16_t char_handle = evt->data.evt_gatt_server_attribute_value.attribute;
        mible_gatts_evt_t event;

