MiEcosystem/mijia_ble_api/efr32_api.c
        gatts_evt_param.conn_handle =
                evt->data.evt_gatt_server_attribute_value.connection;
        gatts_evt_param.write.data =
                evt->data.evt_gatt_server_attribute_value.value.data;
        gatts_evt_param.write.len = evt->data.evt_gatt_server_attribute_value.value.len;
        gatts_evt_param.write.offset = evt->data.evt_gatt_server_attribute_value.offset;
        gatts_evt_param.write.value_handle = char_handle;

        for(uint8_t i=0; i<CHAR_TABLE_NUM; i++){
        	if(m_char_table.item[i].handle == char_handle){
        		if(m_char_table.item[i].wr_author == true){
        			event = MIBLE_GATTS_EVT_WRITE_PERMIT_REQ;
        		}else {
                    event = MIBLE_GATTS_EVT_WRITE;
                }
        		mible_gatts_event_callback(event, &gatts_evt_param);
        		break;
        	}
        }
    }
    break;

    case gecko_evt_gatt_server_user_read_request_id: {

        uint16_t char_handle = 0;
        char_handle = evt->data.evt_gatt_server_user_read_request.characteristic;

        for(uint8_t i=0; i<CHAR_TABLE_NUM; i++){

        	if(m_char_table.item[i].handle == char_handle){

        		if(m_char_table.item[i].rd_author == true){

                    gatts_evt_param.conn_handle =
                            evt->data.evt_gatt_server_user_read_request.connection;

                    gatts_evt_param.read.value_handle =
                            evt->data.evt_gatt_server_user_read_request.characteristic;

                    mible_gatts_event_callback(MIBLE_GATTS_EVT_READ_PERMIT_REQ, &gatts_evt_param);
        		}else{
                    /* Send read response here since no application reaction needed*/
                    if (evt->data.evt_gatt_server_user_read_request.offset>m_char_table.item[i].len) {
                        gecko_cmd_gatt_server_send_user_read_response(
                                evt->data.evt_gatt_server_user_read_request.connection,
                                evt->data.evt_gatt_server_user_read_request.characteristic,
                                (uint8_t)bg_err_att_invalid_offset, 0, NULL);
                    } else {

                        gecko_cmd_gatt_server_send_user_read_response(
                                evt->data.evt_gatt_server_user_read_request.connection,
                                evt->data.evt_gatt_server_user_read_request.characteristic,
                                bg_err_success,
								m_char_table.item[i].len
										- evt->data.evt_gatt_server_user_read_request.offset,
								m_char_table.item[i].data
                                        + evt->data.evt_gatt_server_user_read_request.offset);
                    }
            	}
        		break;
        	}
        }
    }
    break;

    case gecko_evt_gatt_server_user_write_request_id: {

        uint16_t char_handle = evt->data.evt_gatt_server_attribute_value.attribute;
        mible_gatts_evt_t event;

        gatts_evt_param.conn_handle =
                evt->data.evt_gatt_server_attribute_value.connection;
        gatts_evt_param.write.data =
                evt->data.evt_gatt_server_attribute_value.value.data;
        gatts_evt_param.write.len = evt->data.evt_gatt_server_attribute_value.value.len;
        gatts_evt_param.write.offset = evt->data.evt_gatt_server_attribute_value.offset;
        gatts_evt_param.write.value_handle = char_handle;

        for(uint8_t i=0; i<CHAR_TABLE_NUM; i++){
        	if(m_char_table.item[i].handle == char_handle){
        		if(m_char_table.item[i].wr_author == true){
        			event = MIBLE_GATTS_EVT_WRITE_PERMIT_REQ;
        		}else {
                    event = MIBLE_GATTS_EVT_WRITE;
                    if((m_char_table.item[i].char_property & MIBLE_WRITE) != 0){

                    	memcpy(m_char_table.item[i].data + gatts_evt_param.write.offset,
                    			gatts_evt_param.write.data, gatts_evt_param.write.len);

                    	gecko_cmd_gatt_server_send_user_write_response(
                    			evt->data.evt_gatt_server_user_read_request.connection,
								evt->data.evt_gatt_server_user_read_request.characteristic,
                                bg_err_success);
                    }
                }
        		mible_gatts_event_callback(event, &gatts_evt_param);
        		break;
        	}
        }
    }
    break;

    case gecko_evt_gatt_server_characteristic_status_id:

        if (evt->data.evt_gatt_server_characteristic_status.status_flags
                == gatt_server_confirmation) {
            /* Second parameter doesn't have any meaning */
            gatts_evt_param.conn_handle = evt->data.evt_gatt_server_characteristic_status.connection;
            gatts_evt_param.write.value_handle = evt->data.evt_gatt_server_characteristic_status.characteristic;
            mible_gatts_event_callback(MIBLE_GATTS_EVT_IND_CONFIRM, &gatts_evt_param);
        }
    break;

    case gecko_evt_hardware_soft_timer_id: {
        uint8_t handle = evt->data.evt_hardware_soft_timer.handle;
        if (handle == SCAN_TIMEOUT_TIMER_ID) {
            scan_timeout_for_retry = 0;
            mible_gap_scan_stop();
        } else if (handle < MIBLE_TIMER_NUM) {
            m_timer_pool[handle].handler(m_timer_pool[handle].p_ctx);
        }
    }
    break;

    case gecko_evt_system_external_signal_id:
        if (evt->data.evt_system_external_signal.extsignals & START_ADV_RETRY_BIT_MASK) {
            MI_LOG_ERROR("adv retry...\n");
            if (connect_param_for_retry != 0xFF) {
                result =
                gecko_cmd_le_gap_start_advertising(ADV_HANDLE,le_gap_user_data,connect_param_for_retry)->result;
                if (result != bg_err_success) {
                    gecko_external_signal(START_ADV_RETRY_BIT_MASK);
                } else {
                    advertising = 1;
                    connect_param_for_retry = 0xFF;
                }
            }
        }

    break;

    }
    /* Block all stack events */
    return ;
}

