MiEcosystem/mijia_ble_api/efr32_api.c
/*
 * @brief 	Get BLE mac address.
 * @param 	[out] mac: pointer to data
 * @return  MI_SUCCESS			The requested mac address were written to mac
 *          MI_ERR_INTERNAL     No mac address found.
 * @note: 	You should copy gap mac to mac[6]
 * */

mible_status_t mible_gap_address_get(mible_addr_t mac)
{
    struct gecko_msg_system_get_bt_address_rsp_t *ret = gecko_cmd_system_get_bt_address();
    memcpy(mac, ret->address.addr, 6);
    return MI_SUCCESS;
}

/* GAP related function.  You should complement these functions. */

/*
 * @brief	Start scanning
 * @param 	[in] scan_type:	passive or active scaning
 * 			[in] scan_param: scan parameters including interval, windows
 * and timeout
 * @return  MI_SUCCESS             Successfully initiated scanning procedure.
 *          MI_ERR_INVALID_STATE   Has initiated scanning procedure.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 * 		    MI_ERR_BUSY 		   The stack is busy, process pending
 * events and retry.
 * @note 	Other default scanning parameters : public address, no
 * whitelist.
 * 	        The scan response is given through
 * MIBLE_GAP_EVT_ADV_REPORT event
 */
mible_status_t mible_gap_scan_start(mible_gap_scan_type_t scan_type,
        mible_gap_scan_param_t scan_param)
{
    uint16 scan_interval, scan_window;
    uint16_t result;

    if (scanning) {
        return MI_ERR_INVALID_STATE;
    }

    if (scan_type != MIBLE_SCAN_TYPE_PASSIVE ||
        scan_type != MIBLE_SCAN_TYPE_ACTIVE) {
        return MI_ERR_INVALID_PARAM;
    }

    scan_interval = scan_param.scan_interval;
    scan_window = scan_param.scan_window;

    gecko_cmd_le_gap_set_discovery_type(1, (uint8_t)scan_type);
    result = gecko_cmd_le_gap_set_discovery_timing(1, scan_interval, scan_window)->result;
    if (result == bg_err_invalid_param) {
        return MI_ERR_INVALID_PARAM;
    }

    result = gecko_cmd_le_gap_start_discovery(1, le_gap_discover_observation)->result;

    if (result == bg_err_success && scan_param.timeout != 0) {
        gecko_cmd_hardware_set_soft_timer(32768 * scan_param.timeout,
                SCAN_TIMEOUT_TIMER_ID, 1);
    }

    scanning = 1;
    return MI_SUCCESS;
}

/*
 * @brief	Stop scanning
 * @param 	void
 * @return  MI_SUCCESS             Successfully stopped scanning procedure.
 *          MI_ERR_INVALID_STATE   Not in scanning state.
 * */

mible_status_t mible_gap_scan_stop(void)
{
    if (!scanning) {
        return MI_ERR_INVALID_STATE;
    }
    MI_LOG_ERROR("stop scanning\n");
    gecko_cmd_le_gap_end_procedure();
    scanning = 0;
    return MI_SUCCESS;
}

typedef struct {
    uint8_t len;
    uint8_t data[31];
} mible_adv_data_t;

static mible_adv_data_t last_adv_data;
static mible_adv_data_t last_scan_rsp;

/*
 * @brief	Start advertising
 * @param 	[in] p_adv_param : pointer to advertising parameters, see
 * mible_gap_adv_param_t for details
 * @return  MI_SUCCESS             Successfully initiated advertising procedure.
 *          MI_ERR_INVALID_STATE   Initiated connectable advertising procedure
 * when connected.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending events and
 * retry.
 *          MI_ERR_RESOURCES       Stop one or more currently active roles
 * (Central, Peripheral or Observer) and try again.
 * @note	Other default advertising parameters: local public address , no
 * filter policy
 * */
mible_status_t mible_gap_adv_start(mible_gap_adv_param_t *p_param)
{
    uint16_t result;
    uint8 channel_map = 0, connect = 0;

    if (p_param->ch_mask.ch_37_off != 1) {
        channel_map |= 0x01;
    }
    if (p_param->ch_mask.ch_38_off != 1) {
        channel_map |= 0x02;
    }
    if (p_param->ch_mask.ch_39_off != 1) {
        channel_map |= 0x04;
    }

    if ((m_conn_handle != DISCONNECTION)
            && (p_param->adv_type == MIBLE_ADV_TYPE_CONNECTABLE_UNDIRECTED)) {
        return MI_ERR_INVALID_STATE;
    }

    result = gecko_cmd_le_gap_set_advertise_timing(ADV_HANDLE, p_param->adv_interval_min,
            p_param->adv_interval_max, 0, 0)->result;
    MI_ERR_CHECK(result);
    if (result == bg_err_invalid_param) {
        return MI_ERR_INVALID_PARAM;
    }

    result = gecko_cmd_le_gap_set_advertise_channel_map(ADV_HANDLE, channel_map)->result;
    MI_ERR_CHECK(result);
    if (result == bg_err_invalid_param) {
        return MI_ERR_INVALID_PARAM;
    }

    if (p_param->adv_type == MIBLE_ADV_TYPE_CONNECTABLE_UNDIRECTED) {
        connect = le_gap_connectable_scannable;
    } else if (p_param->adv_type == MIBLE_ADV_TYPE_SCANNABLE_UNDIRECTED) {
        connect = le_gap_scannable_non_connectable;
    } else if (p_param->adv_type == MIBLE_ADV_TYPE_NON_CONNECTABLE_UNDIRECTED) {
        connect = le_gap_non_connectable;
    } else {
        return MI_ERR_INVALID_PARAM;
    }

    if (last_adv_data.len != 0) {
        result = gecko_cmd_le_gap_bt5_set_adv_data(ADV_HANDLE, 0,
                last_adv_data.len, last_adv_data.data)->result;
        if (result != bg_err_success)
            return MI_ERR_BUSY;
    }
    if (last_scan_rsp.len != 0) {
        result = gecko_cmd_le_gap_bt5_set_adv_data(ADV_HANDLE, 1,
                last_scan_rsp.len, last_scan_rsp.data)->result;
        if (result != bg_err_success)
            return MI_ERR_BUSY;
    }
    result = gecko_cmd_le_gap_start_advertising(ADV_HANDLE, le_gap_user_data, connect)->result;
    MI_ERR_CHECK(result);
    if (result == bg_err_success) {
        advertising = 1;
        return MI_SUCCESS;
    } else {
        connect_param_for_retry = connect;
        gecko_external_signal(START_ADV_RETRY_BIT_MASK);
        return MI_ERR_BUSY;
    }
}

/**
 * @brief   Config advertising data
 * @param   [in] p_data : Raw data to be placed in advertising packet. If NULL, no changes are made to the current advertising packet.
 * @param   [in] dlen   : Data length for p_data. Max size: 31 octets. Should be 0 if p_data is NULL, can be 0 if p_data is not NULL.
 * @param   [in] p_sr_data : Raw data to be placed in scan response packet. If NULL, no changes are made to the current scan response packet data.
 * @param   [in] srdlen : Data length for p_sr_data. Max size: BLE_GAP_ADV_MAX_SIZE octets. Should be 0 if p_sr_data is NULL, can be 0 if p_data is not NULL.
 * @return  MI_SUCCESS             Successfully set advertising data.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 * */
mible_status_t mible_gap_adv_data_set(uint8_t const * p_data, uint8_t dlen,
        uint8_t const *p_sr_data, uint8_t srdlen)
{
    struct gecko_msg_le_gap_bt5_set_adv_data_rsp_t *ret;

    if (p_data != NULL && dlen <= 31) {
        /* 0 - advertisement, 1 - scan response, set advertisement data here */
        ret = gecko_cmd_le_gap_bt5_set_adv_data(ADV_HANDLE, 0, dlen, p_data);
        if (ret->result == bg_err_invalid_param) {
            return MI_ERR_INVALID_PARAM;
        }
        memcpy(last_adv_data.data, p_data, dlen);
        last_adv_data.len = dlen;
    }

    if (p_sr_data != NULL && srdlen <= 31) {
        /* 0 - advertisement, 1 - scan response, set scan response data here */
        ret = gecko_cmd_le_gap_bt5_set_adv_data(ADV_HANDLE, 1, srdlen, p_sr_data);
        if (ret->result == bg_err_invalid_param) {
            return MI_ERR_INVALID_PARAM;
        }
        memcpy(last_scan_rsp.data, p_sr_data, srdlen);
        last_scan_rsp.len = srdlen;
    }

    return MI_SUCCESS;
}

