MiEcosystem/mijia_ble_api/efr32_api.c
/*
 * @brief	Stop advertising
 * @param	void
 * @return  MI_SUCCESS             Successfully stopped advertising procedure.
 *          MI_ERR_INVALID_STATE   Not in advertising state.
 * */
mible_status_t mible_gap_adv_stop(void)
{
    struct gecko_msg_le_gap_stop_advertising_rsp_t *ret;
    if (!advertising) {
        return MI_ERR_INVALID_STATE;
    }

    ret = gecko_cmd_le_gap_stop_advertising(ADV_HANDLE);
    MI_ERR_CHECK(ret->result);
    if (ret->result == bg_err_success) {
        return MI_SUCCESS;
    } else {
        return MIBLE_ERR_UNKNOWN;
    }
}

/*
 * @brief  	Create a Direct connection
 * @param   [in] scan_param : scanning parameters, see TYPE
 * mible_gap_scan_param_t for details.
 * 			[in] conn_param : connection parameters, see TYPE
 * mible_gap_connect_t for details.
 * @return  MI_SUCCESS             Successfully initiated connection procedure.
 *          MI_ERR_INVALID_STATE   Initiated connection procedure in connected state.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending events and retry.
 *          MI_ERR_RESOURCES       Stop one or more currently active roles
 * (Central, Peripheral or Observer) and try again
 *          MIBLE_ERR_GAP_INVALID_BLE_ADDR    Invalid Bluetooth address
 * supplied.
 * @note 	Own and peer address are both public.
 * 			The connection result is given by MIBLE_GAP_EVT_CONNECTED
 * event
 * */
mible_status_t mible_gap_connect(mible_gap_scan_param_t scan_param,
        mible_gap_connect_t conn_param)
{
// TODO
    return MI_ERR_INVALID_STATE;
}

/*
 * @brief	Disconnect from peer
 * @param 	[in] conn_handle: the connection handle
 * @return  MI_SUCCESS             Successfully disconnected.
 *          MI_ERR_INVALID_STATE   Not in connnection.
 *          MIBLE_ERR_INVALID_CONN_HANDLE
 * @note 	This function can be used by both central role and periphral
 * role.
 * */
mible_status_t mible_gap_disconnect(uint16_t conn_handle)
{
    struct gecko_msg_le_connection_close_rsp_t *ret;
    if (m_conn_handle == DISCONNECTION) {
        return MI_ERR_INVALID_STATE;
    }

    ret = gecko_cmd_le_connection_close(conn_handle);
    if (ret->result == bg_err_success) {
        return MI_SUCCESS;
    } else if (ret->result == bg_err_invalid_conn_handle) {
        return MIBLE_ERR_INVALID_CONN_HANDLE;
    } else if (ret->result == bg_err_not_connected) {
        return MI_ERR_INVALID_STATE;
    } else {
        return MIBLE_ERR_UNKNOWN;
    }
}

/*
 * @brief	Update the connection parameters.
 * @param  	[in] conn_handle: the connection handle.
 *			[in] conn_params: the connection parameters.
 * @return  MI_SUCCESS             The Connection Update procedure has been
 *started successfully.
 *          MI_ERR_INVALID_STATE   Initiated this procedure in disconnected
 *state.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending events and
 *retry.
 *          MIBLE_ERR_INVALID_CONN_HANDLE
 * @note  	This function can be used by both central role and peripheral
 *role.
 * */
mible_status_t mible_gap_update_conn_params(uint16_t conn_handle,
        mible_gap_conn_param_t conn_params)
{
    struct gecko_msg_le_connection_set_parameters_rsp_t *ret;
    if (m_conn_handle == DISCONNECTION) {
        return MI_ERR_INVALID_STATE;
    }

    ret = gecko_cmd_le_connection_set_parameters(conn_handle,
            conn_params.min_conn_interval, conn_params.max_conn_interval,
            conn_params.slave_latency, conn_params.conn_sup_timeout);
    if (ret->result == bg_err_success) {
        return MI_SUCCESS;
    } else if (ret->result == bg_err_invalid_conn_handle) {
        return MIBLE_ERR_INVALID_CONN_HANDLE;
    } else if (ret->result == bg_err_invalid_param) {
        return MI_ERR_INVALID_PARAM;
    } else if (ret->result == bg_err_wrong_state) {
        return MI_ERR_INVALID_STATE;
    }
    return MI_SUCCESS;
}

/* GATTS related function  */
static uint16_t get_uuid_index(const struct bg_gattdb_def *bg_gattdb, mible_uuid_t *p_uuid)
{
    uint16_t index;
    if (p_uuid->type == 0) {
        // UUID16
        for (index = 0; index < bg_gattdb->uuidtable_16_size ; index++)
            if (bg_gattdb->uuidtable_16[index] == p_uuid->uuid16)
                return index;

    } else {
        // UUID128
        for (index = 0; index < bg_gattdb->uuidtable_128_size ; index++)
            if (memcmp(bg_gattdb->uuidtable_128 + index * 16, p_uuid->uuid128, 16) == 0)
                return index;
    }

    return -1;
}

static uint16_t iterate_get_att_handle(uint16_t uuid_idx, uint16_t begin, uint16_t end)
{
    uint16_t handle;
    for (handle = begin; handle <= end; handle++)
        if (bg_gattdb->attributes[handle].uuid == uuid_idx)
            return handle;

    return -1;
}

static int extract_service_region(mible_uuid_t *p_srv_uuid, uint16_t *begin_handle, uint16_t *end_handle)
{
    mible_uuid_t pri_srv_uuid = {
            .uuid16 = 0x2800,
    };
    uint16_t pri_srv_uuid_idx = get_uuid_index(bg_gattdb, &pri_srv_uuid);

    uint16_t handle = 0;
    do {
        handle = iterate_get_att_handle(pri_srv_uuid_idx, handle, bg_gattdb->attributes_max);
        if (memcmp(bg_gattdb->attributes[handle].constdata->data, p_srv_uuid->uuid128, p_srv_uuid->type ? 16 : 2) == 0) {
            *begin_handle = handle;
            *end_handle = iterate_get_att_handle(pri_srv_uuid_idx, handle+1, bg_gattdb->attributes_max);
            return 0;
        } else {
            handle++;
        }
    } while (handle != -1);

    return -1;
}

static uint16_t search_char_handle(mible_uuid_t *p_char_uuid, uint16_t begin_handle, uint16_t end_handle)
{
    uint16_t char_uuid_idx = get_uuid_index(bg_gattdb, p_char_uuid);
    if (p_char_uuid->type == 1)
        char_uuid_idx |= 0x8000;
    return iterate_get_att_handle(char_uuid_idx, begin_handle, end_handle);
}

/*
 * @brief	Add a Service to a GATT server
 * @param 	[in|out] p_server_db: pointer to mible service data type
 * of mible_gatts_db_t, see TYPE mible_gatts_db_t for details.
 * @return  MI_SUCCESS             Successfully added a service declaration.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_NO_MEM	       Not enough memory to complete operation.
 * @note    This function can be implemented asynchronous. When service inition complete, call mible_arch_event_callback function and pass in MIBLE_ARCH_EVT_GATTS_SRV_INIT_CMP event and result.
 * */
mible_status_t mible_gatts_service_init(mible_gatts_db_t *p_server_db)
{
    mible_status_t ret = MI_SUCCESS;
    mible_arch_evt_param_t param;
    uint16_t begin, end;

    extract_service_region(&p_server_db->p_srv_db->srv_uuid, &begin, &end);

    mible_gatts_char_db_t * p_char_db = p_server_db->p_srv_db->p_char_db;
    for(int n = 0; n < p_server_db->p_srv_db->char_num && m_char_table.num < CHAR_TABLE_NUM; n++, p_char_db++) {
        uint16_t handle = search_char_handle(&p_char_db->char_uuid, begin, end);
        if (handle != -1) {
            p_char_db->char_value_handle = handle + 1;
            uint8_t idx = m_char_table.num;
            m_char_table.item[idx].handle = p_char_db->char_value_handle;
            m_char_table.item[idx].rd_author = p_char_db->rd_author;
            m_char_table.item[idx].wr_author = p_char_db->wr_author;
            m_char_table.item[idx].char_property = p_char_db->char_property;
            m_char_table.item[idx].len = p_char_db->char_value_len;
            memcpy(m_char_table.item[idx].data, p_char_db->p_value, p_char_db->char_value_len);
            m_char_table.num++;
        } else {
            MI_LOG_ERROR("no char %d found.\n", p_char_db->char_uuid.uuid16);
            ret = MI_ERR_INTERNAL;
            goto exception;
        }
    }

    param.srv_init_cmp.p_gatts_db = p_server_db;
    param.srv_init_cmp.status = ret;
    mible_arch_event_callback(MIBLE_ARCH_EVT_GATTS_SRV_INIT_CMP, &param);

