MiEcosystem/mijia_ble_api/efr32_api.c
exception:
    return ret;
}

static bool is_vaild_handle(uint16_t handle)
{
    bool handle_exist = false;
    for (uint8_t i = 0; i < CHAR_TABLE_NUM; i++) {
        if (m_char_table.item[i].handle == handle) {
            handle_exist = true;
        }
    }
    return handle_exist;
}

/*
 * @brief	Set characteristic value
 * @param	[in] srv_handle: service handle
 *			[in] value_handle: characteristic value handle
 *			[in] offset: the offset from which the attribute value has
 *to be updated
 *			[in] p_value: pointer to data
 *			[in] len: data length
 * @return  MI_SUCCESS             Successfully retrieved the value of the
 *attribute.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 *          MIBLE_ERR_GATT_INVALID_ATT_TYPE  Attributes are not modifiable by
 *the application.
 * */
mible_status_t mible_gatts_value_set(uint16_t srv_handle, uint16_t value_handle,
        uint8_t offset, uint8_t* p_value, uint8_t len)
{
    if (p_value == NULL) {
        return MI_ERR_INVALID_ADDR;
    }

    if(!is_vaild_handle(value_handle)){
    	return MIBLE_ERR_ATT_INVALID_ATT_HANDLE;
    }


    for(uint8_t i=0; i<CHAR_TABLE_NUM; i++){
    	if(m_char_table.item[i].handle == value_handle){
    		if(m_char_table.item[i].len >= offset + len){
    			memcpy(m_char_table.item[i].data + offset, p_value, len);
    			return MI_SUCCESS;
    		}else{
    			return MI_ERR_INVALID_LENGTH;
    		}
    	}
    }
    return MIBLE_ERR_ATT_INVALID_ATT_HANDLE;
}


/*
 * @brief	Get charicteristic value as a GATTS.
 * @param 	[in] srv_handle: service handle
 * 			[in] value_handle: characteristic value handle
 *			[out] p_value: pointer to data which stores characteristic value
 * 			[out] p_len: pointer to data length.
 * @return  MI_SUCCESS             Successfully get the value of the attribute.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 **/

/*
 * Keivn: offset is not provided, MI_ERR_INVALID_PARAM is not able to check
 */
mible_status_t mible_gatts_value_get(uint16_t srv_handle, uint16_t value_handle,
        uint8_t* p_value, uint8_t *p_len)
{
    if (p_value == NULL || p_len == NULL) {
        return MI_ERR_INVALID_ADDR;
    }

    if(!is_vaild_handle(value_handle)){
    	return MIBLE_ERR_ATT_INVALID_ATT_HANDLE;
    }

    for(uint8_t i=0; i<CHAR_TABLE_NUM; i++){
    	if(m_char_table.item[i].handle == value_handle){
    		*p_len = m_char_table.item[i].len;
    		memcpy(p_value, m_char_table.item[i].data, *p_len);
    		return MI_SUCCESS;
    	}
    }
    return MIBLE_ERR_ATT_INVALID_ATT_HANDLE;
}

// this function set char value and notify/indicate it to client
/*
 * @brief 	Set characteristic value and notify it to client.
 * @param 	[in] conn_handle: conn handle
 *          [in] srv_handle: service handle
 * 			[in] char_value_handle: characteristic handle
 * 			[in] offset: the offset from which the attribute value has to
 * be updated
 * 			[in] p_value: pointer to data
 * 			[in] len: data length
 *          [in] type : notification = 1; indication = 2;
 *
 * @return  MI_SUCCESS             Successfully queued a notification or
 * indication for transmission,
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State or notifications
 * and/or indications not enabled in the CCCD.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 *          MIBLE_ERR_GATT_INVALID_ATT_TYPE  Attributes are not modifiable by
 * the application.
 * @note    This function checks for the relevant Client Characteristic
 * Configuration descriptor
 *          value to verify that the relevant operation (notification or
 * indication) has been enabled by the client.
 * */
mible_status_t mible_gatts_notify_or_indicate(uint16_t conn_handle, uint16_t srv_handle,
        uint16_t char_value_handle, uint8_t offset, uint8_t* p_value, uint8_t len,
        uint8_t type)
{
    struct gecko_msg_gatt_server_send_characteristic_notification_rsp_t *ret;

    if (p_value == NULL) {
        return MI_ERR_INVALID_ADDR;
    }

    if ((uint8_t) conn_handle == DISCONNECTION) {
        return MI_ERR_INVALID_STATE;
    }

    ret = gecko_cmd_gatt_server_send_characteristic_notification(conn_handle,
            char_value_handle, len, p_value);

    if (ret->result == bg_err_wrong_state) {
        // CCC not enabled
        return MI_ERR_INVALID_STATE;
    } else if (ret->result == bg_err_success) {
#if DEBUG_MIBLE
        MI_LOG_DEBUG("notify: ");
        MI_LOG_HEXDUMP(p_value, len);
#endif
        return MI_SUCCESS;
    } else {
#if DEBUG_MIBLE
        MI_LOG_ERROR("notify error 0x%X\n", ret->result);
#endif
        return MIBLE_ERR_UNKNOWN;
    }

}

/**
 * @brief   Respond to a Read/Write user authorization request.
 * @param   [in] conn_handle: conn handle
 *          [in] status:  1: permit to change value ; 0: reject to change value
 *          [in] char_value_handle: characteristic handle
 *          [in] offset: the offset from which the attribute value has to
 * be updated
 *          [in] p_value: Pointer to new value used to update the attribute value.
 *          [in] len: data length
 *          [in] type : read response = 1; write response = 2;
 *
 * @return  MI_SUCCESS             Successfully queued a response to the peer, and in the case of a write operation, GATT updated.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State or no authorization request pending.
 *          MI_ERR_INVALID_LENGTH  Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 * @note    This call should only be used as a response to a MIBLE_GATTS_EVT_READ/WRITE_PERMIT_REQ
 * event issued to the application.
 * */
mible_status_t mible_gatts_rw_auth_reply(uint16_t conn_handle,
        uint8_t permit, uint16_t char_value_handle, uint8_t offset,
        uint8_t* p_value, uint8_t len, uint8_t type)
{
    uint16_t result;
    if (permit == 1 && p_value == NULL) {
        return MI_ERR_INVALID_ADDR;
    }

    switch(type) {
    case 1:
    result =
    gecko_cmd_gatt_server_send_user_read_response(conn_handle,
                                                  char_value_handle,
                                                  permit ? 0 : bg_err_att_read_not_permitted,
                                                  len,
                                                  p_value)->result;
        break;

