MiEcosystem/mijia_ble_api/efr32_api.c
    case 2:
    result =
    gecko_cmd_gatt_server_send_user_write_response(conn_handle,
                                                   char_value_handle,
                                                   permit ? 0 : bg_err_att_write_not_permitted)->result;
        break;
    }

    return result == bg_err_success ? MI_SUCCESS : result;
}

/*TIMER related function*/

/*
 * @brief 	Create a timer.
 * @param 	[out] pp_timer: a pointer to timer handle address which can uniquely
 *  identify the timer.
 * 			[in] timeout_handler: a function will be called when the timer expires.
 * 			[in] mode: repeated or single shot.
 * @return  MI_SUCCESS             If the timer was successfully created.
 *          MI_ERR_INVALID_PARAM   Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   timer module has not been initialized or the
 * timer is running.
 *          MI_ERR_NO_MEM          timer pool is full.
 *
 * */
mible_status_t mible_timer_create(void** pp_timer, mible_timer_handler timeout_handler,
        mible_timer_mode mode)
{
    if (pp_timer == NULL || timeout_handler == NULL)
        return MI_ERR_INVALID_PARAM;

    *pp_timer = acquire_timer();
    if (*pp_timer == NULL)
        return MI_ERR_NO_MEM;

    timer_item_t * p_timer = *pp_timer;
    p_timer->handler = timeout_handler;
    p_timer->is_single_shot = mode == MIBLE_TIMER_SINGLE_SHOT;
    return MI_SUCCESS;
}

/*
 * @brief 	Delete a timer.
 * @param 	[in] timer_handle: unique index of the timer.
 * @return  MI_SUCCESS             If the timer was successfully deleted.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied..
 * */
mible_status_t mible_timer_delete(void* timer_handle)
{
    if (release_timer(timer_handle) == -1)
        return MI_ERR_INVALID_PARAM;
    else
        return MI_SUCCESS;
}

/*
 * @brief 	Start a timer.
 * @param 	[in] timer_handle: unique index of the timer.
 *          [in] time_ms: number of milliseconds to time-out event
 * (minimum 10 ms).
 * 			[in] p_context: parameters that can be passed to
 * timeout_handler
 *
 * @return  MI_SUCCESS             If the timer was successfully started.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied.
 *          MI_ERR_INVALID_STATE   If the application timer module has not been
 * initialized or the timer has not been created.
 *         	MI_ERR_NO_MEM          If the timer operations queue was full.
 * @note 	If the timer has already started, it will start counting again.
 * */
mible_status_t mible_timer_start(void* timer_handle, uint32_t time_ms, void* p_context)
{
    if (assert_timer(timer_handle) == -1)
        return MI_ERR_INVALID_PARAM;

    timer_item_t * p_timer = timer_handle;
    int ret = gecko_cmd_hardware_set_soft_timer(
                    TIMER_MS_2_TIMERTICK(time_ms),
                    p_timer->id,
                    p_timer->is_single_shot)->result;

    return ret == 0 ? MI_SUCCESS : MI_ERR_INVALID_STATE;
}

/*
 * @brief 	Stop a timer.
 * @param 	[in] timer_handle: unique index of the timer.
 * @return  MI_SUCCESS             If the timer was successfully stopped.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied.
 *
 * */
mible_status_t mible_timer_stop(void* timer_handle)
{
    if (assert_timer(timer_handle) == -1)
        return MI_ERR_INVALID_PARAM;

    timer_item_t * p_timer = timer_handle;
    int ret = gecko_cmd_hardware_set_soft_timer(
                    0,
                    p_timer->id,
                    p_timer->is_single_shot)->result;

    return ret == 0 ? MI_SUCCESS : MI_ERR_INVALID_PARAM;
}

/* FLASH related function*/

/*
 * @brief 	Create a record in flash
 * @param 	[in] record_id: identify a record in flash
 * 			[in] len: record length
 * @return 	MI_SUCCESS 				Create successfully.
 * 			MI_ERR_INVALID_LENGTH   Size was 0, or higher than the maximum
 *allowed size.
 *   		MI_ERR_NO_MEM,			Not enough flash memory to be assigned
 *
 * */
mible_status_t mible_record_create(uint16_t record_id, uint8_t len)
{
    return MI_SUCCESS;
}

/*
 * @brief  	Delete a record in flash
 * @param 	[in] record_id: identify a record in flash
 * @return 	MI_SUCCESS 				Delete successfully.
 * 			MI_ERR_INVALID_PARAM   Invalid record id supplied.
 * */
mible_status_t mible_record_delete(uint16_t record_id)
{
    if (record_id > 127) {
        return MI_ERR_INVALID_PARAM;
    }

    struct gecko_msg_flash_ps_erase_rsp_t *p_rsp;
    p_rsp = gecko_cmd_flash_ps_erase(record_id + 0x4000);

    mible_arch_evt_param_t arch_evt_param;
    arch_evt_param.record.id = record_id;
    arch_evt_param.record.status = p_rsp->result == bg_err_success ? MI_SUCCESS : MI_ERR_RESOURCES;
    mible_arch_event_callback(MIBLE_ARCH_EVT_RECORD_DELETE, &arch_evt_param);
    return MI_SUCCESS;
}

/*
 * @brief 	Restore data to flash
 * @param 	[in] record_id: identify an area in flash
 * 			[out] p_data: pointer to data
 *			[in] len: data length
 * @return  MI_SUCCESS              The command was accepted.
 *          MI_ERR_INVALID_LENGTH   Size was 0, or higher than the maximum
 *allowed size.
 *          MI_ERR_INVALID_PARAM   Invalid record id supplied.
 *          MI_ERR_INVALID_ADDR     Invalid pointer supplied.
 * */
mible_status_t mible_record_read(uint16_t record_id, uint8_t* p_data, uint8_t len)
{
    // TODO: support length longer than 56.
    if (len > MAX_SINGLE_PS_LENGTH){
        return MI_ERR_INVALID_LENGTH;
    } else if (record_id > 127) {
        return MI_ERR_INVALID_PARAM;
    } else if (p_data == NULL) {
        return MI_ERR_INVALID_ADDR;
    }

    struct gecko_msg_flash_ps_load_rsp_t *p_rsp;
    p_rsp = gecko_cmd_flash_ps_load(record_id + 0x4000);

    if (p_rsp->result == bg_err_success) {
        memcpy(p_data, p_rsp->value.data, len);
        return MI_SUCCESS;
    } else {
        return MI_ERR_INVALID_PARAM;
    }
}

/*
 * @brief 	Store data to flash
 * @param 	[in] record_id: identify an area in flash
 * 			[in] p_data: pointer to data
 * 			[in] len: data length
 * @return  MI_SUCCESS              The command was accepted.
 *          MI_ERR_INVALID_LENGTH   Size was 0, or higher than the maximum
 * allowed size.
 *          MI_ERR_INVALID_PARAM   p_data is not aligned to a 4 byte boundary.
 * @note  	Should use asynchronous mode to implement this function.
 *          The data to be written to flash has to be kept in memory until the
 * operation has terminated, i.e., an event is received.
 * 			When record writing complete , call mible_arch_event_callback function and pass MIBLE_ARCH_EVT_RECORD_WRITE_CMP event and result.
 * */
mible_status_t mible_record_write(uint16_t record_id, const uint8_t* p_data, uint8_t len)
{
    // TODO: support length longer than 56.
    if (len > MAX_SINGLE_PS_LENGTH){
        return MI_ERR_INVALID_LENGTH;
    } else if (p_data == NULL || record_id > 127) {
        return MI_ERR_INVALID_PARAM;
    }

    struct gecko_msg_flash_ps_save_rsp_t *p_rsp;
    p_rsp = gecko_cmd_flash_ps_save(record_id + 0x4000, len, p_data);

    mible_arch_evt_param_t arch_evt_param;
    arch_evt_param.record.id = record_id;
    arch_evt_param.record.status = p_rsp->result == bg_err_success ? MI_SUCCESS : MI_ERR_RESOURCES;
    mible_arch_event_callback(MIBLE_ARCH_EVT_RECORD_WRITE, &arch_evt_param);
    return MI_SUCCESS;
}

