MiEcosystem/mijia_ble_api/efr32_api.c
/*
 * @brief 	Get ture random bytes .
 * @param 	[out] p_buf: pointer to data
 * 			[in] len: Number of bytes to take from pool and place in
 * p_buff
 * @return  MI_SUCCESS			The requested bytes were written to
 * p_buff
 *          MI_ERR_NO_MEM       No bytes were written to the buffer, because
 * there were not enough random bytes available.
 * @note  	SHOULD use TRUE random num generator
 * */
mible_status_t mible_rand_num_generator(uint8_t* p_buf, uint8_t len)
{
    struct gecko_msg_system_get_random_data_rsp_t *ret;
    uint8_t times;
    uint8_t rest;

    times = len / MAX_SINGLE_RANDOM_DATA_LENGTH;
    rest = len % MAX_SINGLE_RANDOM_DATA_LENGTH;

    for (uint8_t i = 0; i < times; i++) {
        ret = gecko_cmd_system_get_random_data(MAX_SINGLE_RANDOM_DATA_LENGTH);
        if (ret->result == bg_err_success) {
            memcpy(p_buf + MAX_SINGLE_RANDOM_DATA_LENGTH * i, ret->data.data,
                    ret->data.len);
        } else {
            return MI_ERR_NO_MEM;
        }
    }

    ret = gecko_cmd_system_get_random_data(rest);
    if (ret->result == bg_err_success) {
        memcpy(p_buf + MAX_SINGLE_RANDOM_DATA_LENGTH * times, ret->data.data,
                ret->data.len);
    } else {
        return MI_ERR_NO_MEM;
    }
    return MI_SUCCESS;
}

/*
 * @brief 	Encrypts a block according to the specified parameters. 128-bit
 * AES encryption.
 * @param 	[in] key: encryption key
 * 			[in] plaintext: pointer to plain text
 * 			[in] plen: plain text length
 *          [out] ciphertext: pointer to cipher text
 * @return  MI_SUCCESS              The encryption operation completed.
 *          MI_ERR_INVALID_ADDR     Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE    Encryption module is not initialized.
 *          MI_ERR_INVALID_LENGTH   Length bigger than 16.
 *          MI_ERR_BUSY             Encryption module already in progress.
 * @note  	SHOULD use synchronous mode to implement this function
 * */
mible_status_t mible_aes128_encrypt(const uint8_t* key, const uint8_t* plaintext,
        uint8_t plen, uint8_t* ciphertext)
{
    uint8_t tmpPlain[16];
    uint8_t tmpCipher[16];
    mbedtls_aes_context aes_ctx;

    if (key == NULL || plaintext == NULL || ciphertext == NULL) {
        return MI_ERR_INVALID_ADDR;
    }

    if (plen > 16) {
        return MI_ERR_INVALID_LENGTH;
    }

    mbedtls_aes_init(&aes_ctx);
    memset(tmpPlain, 0, 16);
    memset(tmpCipher, 0, 16);

    memcpy(tmpPlain, plaintext, plen);
    mbedtls_aes_setkey_enc(&aes_ctx, key, 128);
    mbedtls_aes_crypt_ecb(&aes_ctx, MBEDTLS_AES_ENCRYPT, tmpPlain, tmpCipher);

    memcpy(ciphertext, tmpCipher, 16);

    return MI_SUCCESS;
}

/* TASK schedulor related function  */
#include "common/queue.h"
typedef struct {
    mible_handler_t handler;
    void *arg;
} mible_task_t;

static mible_task_t task_buf[MAX_TASK_NUM];
static queue_t task_queue;
/*
 * @brief 	Post a task to a task quene, which can be executed in a right place(maybe a task in RTOS or while(1) in the main function).
 * @param 	[in] handler: a pointer to function
 * 			[in] param: function parameters
 * @return 	MI_SUCCESS 				Successfully put the handler to quene.
 * 			MI_ERR_NO_MEM			The task quene is full.
 * 			MI_ERR_INVALID_PARAM    Handler is NULL
 * */
mible_status_t mible_task_post(mible_handler_t handler, void *arg)
{
    static uint8_t task_queue_is_init = 0;
    uint32_t errno;
    if (!task_queue_is_init){
        task_queue_is_init = 1;
        errno = queue_init(&task_queue, task_buf,
                            sizeof(task_buf) / sizeof(task_buf[0]), sizeof(task_buf[0]));
        MI_ERR_CHECK(errno);
    }

    mible_task_t task = {
        .handler = handler,
        .arg     = arg,
    };

    errno = enqueue(&task_queue, &task);
    return errno;
}

void mible_tasks_exec(void)
{
    uint32_t errno = 0;
    mible_task_t task;
    while(!errno) {
        errno = dequeue(&task_queue, &task);
        if (errno == MI_SUCCESS)
            task.handler(task.arg);
    }
}

/**
 *        IIC APIs
 */
#include "em_i2c.h"
static bool iic_is_busy;
static const iic_config_t * m_p_iic_config;
static mible_handler_t m_iic_handler;
static I2C_TransferSeq_TypeDef seq;
/*****************************************************************************
 * @brief  Handles various I2C events and errors
 *
 * When a STOP condition has been successfully sent, the MSTOP
 * interrupt is triggered and the transfer is marked as complete.
 *
 * The three errors: ARBLOST, BUSERR, and NACK are handled here.
 * In all cases, the current transfer is aborted, and the error
 * flag is set to inform the main loop that an error occured
 * during the transfer.
 *****************************************************************************/
void I2C0_IRQHandler(void)
{
    iic_event_t event;
    I2C_TransferReturn_TypeDef xfer_stat;
    xfer_stat = I2C_Transfer(I2C0);
    switch(xfer_stat){
    case i2cTransferInProgress:
        break;
    case i2cTransferDone:
        event = IIC_EVT_XFER_DONE;
        m_iic_handler(&event);
        break;
    case i2cTransferNack:
        event = IIC_EVT_DATA_NACK;
        m_iic_handler(&event);
        break;
    default:
        MI_LOG_ERROR("iic bus errno %d.\n", xfer_stat);
        event = IIC_EVT_ADDRESS_NACK;
        m_iic_handler(&event);
        break;
    }
}
/**
 * @brief   Function for initializing the IIC driver instance.
 * @param   [in] p_config: Pointer to the initial configuration.
 *          [in] handler: Event handler provided by the user.
 * @return  MI_SUCCESS              Initialized successfully.
 *          MI_ERR_INVALID_PARAM    p_config or handler is a NULL pointer.
 *
 * */
mible_status_t mible_iic_init(const iic_config_t * p_config,
        mible_handler_t handler)
{
    if (p_config != NULL && handler != NULL) {
        m_p_iic_config = p_config;
        m_iic_handler = handler;
    } else {
        return MI_ERR_INVALID_PARAM;
    }

    CMU_ClockEnable(cmuClock_HFPER, true);
    /* Select I2C peripheral clock */
    CMU_ClockEnable(cmuClock_I2C0, true);

    /* Output value must be set to 1 to not drive lines low. Set
       SCL first, to ensure it is high before changing SDA. */
    GPIO_PinModeSet(p_config->scl_port, p_config->scl_pin, gpioModeWiredAndPullUp, 1);
    GPIO_PinModeSet(p_config->sda_port, p_config->sda_pin, gpioModeWiredAndPullUp, 1);

//    /* In some situations, after a reset during an I2C transfer, the slave
//       device may be left in an unknown state. Send 9 clock pulses to
//       set slave in a defined state. */
//    for (i = 0; i < 9; i++) {
//      GPIO_PinOutSet(p_config->scl_port, p_config->scl_pin);
//      GPIO_PinOutClear(p_config->scl_port, p_config->scl_pin);
//    }

    /* Enable pins and set location */
  #if defined (_I2C_ROUTEPEN_MASK)
    I2C0->ROUTEPEN = I2C_ROUTEPEN_SDAPEN | I2C_ROUTEPEN_SCLPEN;
    I2C0->ROUTELOC0 = (p_config->sda_extra_conf << _I2C_ROUTELOC0_SDALOC_SHIFT)
                    | (p_config->scl_extra_conf << _I2C_ROUTELOC0_SCLLOC_SHIFT);
  #else
    I2C0->ROUTE = I2C_ROUTE_SDAPEN
                | I2C_ROUTE_SCLPEN
                | (p_config->scl_extra_conf << _I2C_ROUTE_LOCATION_SHIFT);
  #endif

    /* Set emlib i2c0 init parameters */
    I2C_Init_TypeDef i2cInit = {0};
    i2cInit.enable = true;
    i2cInit.master = true; /* master mode only */
    i2cInit.refFreq = 0;
    i2cInit.freq = p_config->freq == IIC_100K ? I2C_FREQ_STANDARD_MAX : I2C_FREQ_FAST_MAX;
    i2cInit.clhr = i2cClockHLRStandard;
    I2C_Init(I2C0, &i2cInit);
    iic_is_busy = true;

    return MI_SUCCESS;
}

/**
 * @brief   Function for uninitializing the IIC driver instance.
 *
 *
 * */
void mible_iic_uninit(void)
{
    NVIC_DisableIRQ(I2C0_IRQn);
    I2C_Reset(I2C0);
    GPIO_PinModeSet(m_p_iic_config->scl_port, m_p_iic_config->scl_pin, gpioModeDisabled, 0);
    GPIO_PinModeSet(m_p_iic_config->sda_port, m_p_iic_config->sda_pin, gpioModeDisabled, 0);
    CMU_ClockEnable(cmuClock_I2C0, false);
    iic_is_busy = false;
}

/**
 * @brief   Function for sending data to a IIC slave.
 * @param   [in] addr:   Address of a specific slave device (only 7 LSB).
 *          [in] p_out:  Pointer to tx data
 *          [in] len:    Data length
 *          [in] no_stop: If set, the stop condition is not generated on the bus
 *          after the transfer has completed successfully (allowing for a repeated start in the next transfer).
 * @return  MI_SUCCESS              The command was accepted.
 *          MI_ERR_BUSY             If a transfer is ongoing.
 *          MI_ERR_INVALID_PARAM    p_out is not vaild address.
 * @note    This function should be implemented in non-blocking mode.
 *          When tx procedure complete, the handler provided by mible_iic_init() should be called,
 * and the iic event should be passed as a argument.
 * */
mible_status_t mible_iic_tx(uint8_t addr, uint8_t * p_out, uint16_t len,
bool no_stop)
{
    uint32_t errno;
    if (p_out == NULL && len > 512) {
        return MI_ERR_INVALID_PARAM;
    }

    // Enable interrupts in NVIC
    NVIC_ClearPendingIRQ(I2C0_IRQn);
    NVIC_EnableIRQ(I2C0_IRQn);

