MiEcosystem/mijia_ble_api/efr32_api.c
    // Enable i2c interrupts
    I2C_IntClear(I2C0, I2C_IEN_ARBLOST|I2C_IEN_BUSERR|I2C_IEN_NACK|I2C_IEN_ACK|
            I2C_IEN_RXDATAV|I2C_IEN_MSTOP);
    I2C_IntEnable(I2C0, I2C_IEN_ARBLOST|I2C_IEN_BUSERR|I2C_IEN_NACK|I2C_IEN_ACK|
            I2C_IEN_RXDATAV|I2C_IEN_MSTOP);

    seq = (I2C_TransferSeq_TypeDef){
            .addr = addr << 1,
            .flags = I2C_FLAG_WRITE,
            .buf[0].data = p_out,
            .buf[0].len = len
    };

    errno = I2C_TransferInit(I2C0, &seq);

    if (errno != i2cTransferInProgress) {
        MI_LOG_INFO("cant start iic tx. errno: %d\n", errno);
        return errno;
    } else {
        return MI_SUCCESS;
    }
}

/**
 * @brief   Function for receiving data from a IIC slave.
 * @param   [in] addr:   Address of a specific slave device (only 7 LSB).
 *          [out] p_in:  Pointer to rx data
 *          [in] len:    Data length
 * @return  MI_SUCCESS              The command was accepted.
 *          MI_ERR_BUSY             If a transfer is ongoing.
 *          MI_ERR_INVALID_PARAM    p_in is not vaild address.
 * @note    This function should be implemented in non-blocking mode.
 *          When rx procedure complete, the handler provided by mible_iic_init() should be called,
 * and the iic event should be passed as a argument.
 * */
mible_status_t mible_iic_rx(uint8_t addr, uint8_t * p_in, uint16_t len)
{
    uint32_t errno;
    if (p_in == NULL && len > 512) {
        return MI_ERR_INVALID_PARAM;
    }

    // Enable interrupts in NVIC
    NVIC_ClearPendingIRQ(I2C0_IRQn);
    NVIC_EnableIRQ(I2C0_IRQn);

    // Enable i2c interrupts
    I2C_IntClear(I2C0, I2C_IEN_ARBLOST|I2C_IEN_BUSERR|I2C_IEN_NACK|I2C_IEN_ACK|
            I2C_IEN_RXDATAV|I2C_IEN_MSTOP);
    I2C_IntEnable(I2C0, I2C_IEN_ARBLOST|I2C_IEN_BUSERR|I2C_IEN_NACK|I2C_IEN_ACK|
            I2C_IEN_RXDATAV|I2C_IEN_MSTOP);

    seq = (I2C_TransferSeq_TypeDef){
            .addr = addr << 1,
            .flags = I2C_FLAG_READ,
            .buf[0].data = p_in,
            .buf[0].len = len
    };

    errno = I2C_TransferInit(I2C0, &seq);

    if (errno != i2cTransferInProgress) {
        MI_LOG_INFO("cant start iic rx. errno: %d\n", errno);
        return errno;
    } else {
        return MI_SUCCESS;
    }
}

/**
 * @brief   Function for checking IIC SCL pin.
 * @param   [in] port:   SCL port
 *          [in] pin :   SCL pin
 * @return  1: High (Idle)
 *          0: Low (Busy)
 * */
int mible_iic_scl_pin_read(uint8_t port, uint8_t pin)
{
    return GPIO_PinInGet(port, pin);
}

mible_status_t mible_nvm_init(void)
{
    static bool enable = false;

    if (!enable) {
        MSC_Init();
        enable = true;
    }

    return MI_SUCCESS;
}

/**
 * @brief   Function for loadind data from Non-Volatile Memory.
 * @param   [out] p_data:  Pointer to data to be restored.
 *          [in] length:   Data size in bytes.
 *          [in] address:  Address in Non-Volatile Memory to read.
 * @return  MI_ERR_INTERNAL:  invalid NVM address.
 *          MI_SUCCESS
 * */
mible_status_t mible_nvm_read(void * p_data, uint32_t length, uint32_t address)
{
    if (MSC->STATUS & MSC_STATUS_BUSY) {
        MI_LOG_WARNING("%s -- flash is busy\n", __func__);
        return MI_ERR_BUSY;
    }

    if (NULL == p_data || 0 == length) {
        MI_LOG_WARNING("%s -- invalid parameter\n", __func__);
        return MI_ERR_INVALID_PARAM;
    }

    memcpy(p_data, (void *)(address), length);
    return MI_SUCCESS;
}

static bool nvm_is_erased(uint32_t address, uint32_t length)
{
    for (uint32_t i = 0; i < length; i += 4) {
        if (*(uint32_t *)(address + i) != 0xFFFFFFFF) {
            return false;
        }
    }

    return true;
}

static bool nvm_part_erase(uint32_t address)
{
    MSC_Status_TypeDef ret;

    if (0 == address % FLASH_PAGE_SIZE) {
        return true;
    }

    if (MSC->STATUS & MSC_STATUS_BUSY) {
        MI_LOG_WARNING("%s -- flash is busy\n", __func__);
        return false;
    }

    uint32_t buffer[(address % FLASH_PAGE_SIZE) / 4 + 1];

    memcpy(buffer, (const void *)(address - address % FLASH_PAGE_SIZE),
                address % FLASH_PAGE_SIZE);
    ret = MSC_ErasePage((uint32_t *)(address - address % FLASH_PAGE_SIZE));
    if (mscReturnOk != ret) {
        MI_LOG_WARNING("%s -- erase error code %d\n", __func__, ret);
        return false;
    }

    ret = MSC_WriteWord((uint32_t *)(address - address % FLASH_PAGE_SIZE),
                                    buffer, address % FLASH_PAGE_SIZE);
    if (mscReturnOk != ret) {
        MI_LOG_WARNING("%s -- write error code %d\n", __func__, ret);
        return false;
    }

    return true;
}

/**
 * @brief   Function for storing data into Non-Volatile Memory.
 * @param   [in] p_data:   Pointer to data to be stored.
 *          [in] length:   Data size in bytes.
 *          [in] address:  Start address used to store data.
 * @return  MI_ERR_INTERNAL:  invalid NVM address.
 *          MI_SUCCESS
 * */
mible_status_t mible_nvm_write(void * p_data, uint32_t length, uint32_t address)
{
    MSC_Status_TypeDef ret;
    MSC_Init();
    if (MSC->STATUS & MSC_STATUS_BUSY) {
        return MI_ERR_BUSY;
    }

    if (NULL == p_data || 0 == length) {
        return MI_ERR_INVALID_PARAM;
    }

    if (0 == address % FLASH_PAGE_SIZE) {
        ret = MSC_ErasePage((uint32_t *)address);
        if (mscReturnOk != ret) {
            MI_LOG_WARNING("%s -- erase error code %d\n", __func__, ret);
            return MI_ERR_INTERNAL;
        }
    } else if (!nvm_is_erased(address, length)) {
        if (!nvm_part_erase(address)) {
            return MI_ERR_INTERNAL;
        }
    }

    ret = MSC_WriteWord((uint32_t *)address, p_data, length);
    if (ret == mscReturnOk) {
        return MI_SUCCESS;
    } else {
        MI_LOG_WARNING("%s -- write error code %d\n", __func__, ret);
        return MI_ERR_INTERNAL;
    }
}


#include "btl_interface.h"
mible_status_t mible_upgrade_firmware(void)
{
    uint32 errno = bootloader_init();
    MI_ERR_CHECK(errno);
    bootloader_rebootAndInstall();

    return MI_SUCCESS;
}
